Repository: rudi-cilibrasi/classic-complearn
Catalog: po/*.po
Languages: de, ru

source: Usage: anycompress [options] <infile> [<outfile>] OPTIONS: -c, --compressor=COMPNAME set compressor to use -h, --help print this help message -L, --list list compressors -v, --verbose print extra detailed information
de: Aufruf: anycompress [Optionen] <Eingabedatei> [<Ausgabedatei>] OPTIONEN: -c, --compressor=COMPNAME zu benutzendes Packprogramm angeben -h, --help diese Hilfe anzeigen -L, --list Packprogramme auflisten -v, --verbose zusätzliche detaillierte Information ausgeben
ru: Использование: anycompress [параметры] <входной файл> [<выходной файл>] ПАРАМЕТРЫ: -c, --compressor=COMPNAME указать компрессор -h, --help показать это сообщение -L, --list показать список компрессоров -v, --verbose показывать дополнительно подробную информацию

source: Unrecognized option:
de: Unbekannte Option:
ru: Неизвестный параметр:

source: Compressor %s is a non-coding compressor.
de: Packprogramm %s ist ein nicht codierendes Packprogramm.
ru: Компрессор %s не является кодирующим.

source: Don't know what to do with extra arguments.
de: Es ist nicht bekannt, was mit den zusätzlichen Argumenten getan werden soll.
ru: Непонятно, что делать с лишними параметрами.

source: Opening output file %s
de: Ausgabedatei %s wird geöffnet
ru: Открывается выходной файл %s

source: Usage: anydecompress [options] <infile> [<outfile>] OPTIONS: -h, --help print this help message -L, --list list compressors -v, --verbose print extra detailed information
de: Aufruf: anydecompress [Optionen] <Eingabedatei> [<Ausgabedatei>] OPTIONEN: -h, --help diese Hilfe anzeigen -L, --list Packprogramme auflisten -v, --verbose zusätzliche detaillierte Information ausgeben
ru: Использование: anydecompress [параметры] <входной файл> [<выходной файл>] ПАРАМЕТРЫ: -h, --help показать это сообщение -L, --list показать список компрессоров -v, --verbose показывать дополнительно подробную информацию

source: Unrecognized option '%c'
de: Unbekannte Option »%c«
ru: Неизвестный параметр '%c'

source: Found matching compressor %s
de: Passendes Packprogramm %s gefunden
ru: Найден подходящий компрессор %s

source: Cannot find matching decompressor.
de: Es kann kein passendes Entpackprogramm gefunden werden.
ru: Не найден подходящий компрессор.

source: Cannot write NULL gsl_matrix, exitting.
de: »NULL gsl_matrix« kann nicht geschrieben werden, wird beendet.
ru: Не удалось записать NULL gsl_matrix, завершение работы.

source: Invalid gsl_matrix size, cannot write. Exitting.
de: Ungültige Größe der »gsl_matrix«, kann nicht geschrieben werden. Wird beendet.
ru: Неправильный размер gsl_matrix, запись невозможна. Завершение работы.

source: untitled
de: ohne Titel
ru: неозаглавленный

source: unknown
de: unbekannt
ru: неизвестный

source: Cannot load bzlib
de: »bzlib« kann nicht geladen werden
ru: Не удалось загрузить bzlib

source: Cannot load bzlib compressor.
de: Packprogramm »bzlib« kann nicht geladen werden
ru: Не удалось загрузить компрессор bzlib.

source: Failed to parse document.
de: Auswerten des Dokuments fehlgeschlagen.
ru: Не удалось разобрать документ.

source: Error, no labels for dimension 1.
de: Fehler, keine Beschriftungen für Dimension 1.
ru: Ошибка, нет меток для массива 1.

source: Error, no labels for dimension 2.
de: Fehler, keine Beschriftungen für Dimension 2.
ru: Ошибка, нет меток для массива 2.

source: Must set_compressor before trying to compress.
de: Bevor das Packen versucht wird, muss »set_compressor« ausgeführt werden
ru: Нужно задать set_compressor перед тем как выполнять сжатие.

source: Compressor index %d out of bounds.
de: Packprogrammindex %d nicht erlaubt.
ru: Индекс компрессора %d вне границ диапазона.

source: Usage: complearn-config [options]
de: Aufruf: complearn-config [Optionen]
ru: Использование: complearn-config [параметры]

source: directory where modules can be found
de: Verzeichnis, in dem Module gefunden werden können
ru: каталог с модулями

source: verbose
de: detailliert

source: print extra detailed information
de: zusätzliche detaillierte Informationen ausgeben
ru: показывать дополнительно подробную информацию

source: scheduling priority, higher is less CPU
de: Planungspriorität, je höher der Wert, desto niedriger die CPU-Priorität
ru: приоритет процесса, чем больше значение, тем меньше используется ЦП

source: Cannot make more than one environment, use complearn_init() to begin.
de: Es kann nicht mehr als eine Umgebung erstellt werden, benutzen Sie zum Beginnen »complearn_init()«
ru: Невозможно сделать более одного окружения, сначала используйте complearn_init().

source: Trying to read modules directory %s
de: Es wird versucht, das Modulverzeichnis %s zu lesen
ru: Попытка прочитать модули в каталоге %s

source: Trying to load module %s
de: Es wird versucht, das Modul %s zu laden
ru: Попытка загрузить модуль %s

source: Error loading module %s
de: Fehler beim Laden von Modul %s
ru: Ошибка загрузки модуля %s

source: Loaded module %s successfully
de: Modul %s erfolgreich geladen
ru: Модуль %s загружен успешно

source: Compressor %s is not operational.
de: Packprogramm %s ist nicht einsatzbereit.
ru: Компрессор %s не работает.

source: Reading config file %s.
de: Konfigurationsdatei %s wird gelesen.
ru: Чтение конфигурационного файла %s.

source: Cannot find group %s
de: Gruppe %s kann nicht gefunden werden
ru: Не удалось найти группу %s

source: Cannot open file %s for writing
de: Datei %s kann nicht zum Schreiben geöffnet werden
ru: Не удалось открыть файл %s на запись

source: Type %s unknown
de: Typ %s ist unbekannt
ru: Неизвестный тип %s

source: Warning: cannot set nice priority to level %d
de: Warnung: Nice-Priorität kann nicht auf Stufe %d gesetzt werden
ru: Предупреждение: не удалось установить приоритет процесса равным %d

source: Set nice priority level to %d
de: Nice-Priorität auf Stufe %d setzen
ru: Установить приоритет процесса равным %d

source: No property named %s in object.
de: Objekt enthält keine Eigenschaft mit Namen %s.
ru: В объекте нет свойства с именем %s.

source: No name for object at %p
de: Kein Name für Objekt bei %p
ru: Нет имени объекта в %p

source: NULL keyfile for %s.
de: Schlüsseldatei NULL für %s.
ru: keyfile равен NULL для %s.

source: No object at %s.
de: Kein Objekt bei %s
ru: Нет объекта в %s.

source: Decompression Command
de: Entpackbefehl
ru: Команда декомпрессии

source: Command to decompress from stdin to stdout
de: Befehl, um von STDIN nach STDOUT zu entpacken
ru: Команда декомпрессии из stdin в stdout

source: Compression Command
de: Packbefehl
ru: Команда компрессии

source: Command to compress from stdin to stdout
de: Befehl, um von STDIN nach STDOUT zu packen
ru: Команда компрессии из stdin в stdout

source: and
de: und
ru: и

source: external commands.
de: externe Befehle.
ru: внешние команды.

source: prefix of output filename for matrix
de: Präfix des Ausgabedateinamens für die Matrix
ru: префикс имени выходного файла для матрицы

source: compressor
de: Packprogramm

source: default compressor to use
de: zu benutzendes Standardpackprogramm
ru: используемый компрессор по умолчанию

source: remove common prefixes/suffixes from names
de: übliche Prä-/Suffixe von Namen entfernen
ru: удалить общие префиксы/суффиксы из имён

source: write text format matrix to file
de: Textformat-Matrix in Datei schreiben
ru: записать матрицу в текстовом формате в файл

source: print a clb-format output distance matrix
de: eine Ausgabe-Distanzmatrix im »clb-format« ausgeben
ru: показать выходную матрицу расстояний в формате clb-format

source: print a plain format output distance matrix
de: eine Ausgabe-Distanzmatrix im Klartext ausgeben
ru: показать выходную матрицу расстояний в простом формате

source: print a NEXUS format output distance matrix
de: eine Ausgabe-Distanzmatrix im NEXUS-Format ausgeben
ru: показать выходную матрицу расстояний в формате NEXUS

source: zero diagonal when arguments are the same
de: Nulldiagonale, falls die Argumente gleich sind
ru: обнулять диагональ, если аргументы одинаковы

source: perform SVD projection on the matrix
de: eine SVD-Projektion auf der Matrix durchführen
ru: выполнить проекцию SVD на матрицу

source: print HTML table in text output mode
de: HTML-Tabelle im Textausgabemodus ausgeben
ru: показывать таблицу HTML при текстовом режиме вывода

source: print labels in default text output mode
de: Beschriftungen im Standard-Textausgabemodus ausgeben
ru: показывать метки в текстовом режиме вывода по умолчанию

source: only calculate compressed size, not NCD
de: nur gepackte Größe berechnen, keine NCD
ru: вычислять только размер сжатия, а не NCD

source: average matrix before outputting result
de: Durchschnittsmatrix vor der Ausgabe des Ergebnisses
ru: усреднить матрицу перед выводом результата

source: Only one ncd object may be created.
de: Es könnte nur ein NCD-Objekt erstellt worden sein.
ru: Может быть создан только один объект ncd.

source: Usage: ncd [options] ... <arg> Use one argument form to do simple single-object or object-vector compression or ncd [options] ... <arg1> <arg2> for compression-matrix or NCD matrix calculation OPTIONS: -b, --binary-output enable binary output mode for matrix -c, --compressor=COMPNAME set compressor to use -d, --directory-mode directory of files -f, --file-mode a single file -h, --help print this help message -l, --literal-mode a single string literal (default) -L, --list list compressors -n, --nexus-output output NEXUS format distance matrix -o, --output=FILESTEM use FILESTEM instead of distmatrix -p, --plainlist-mode lines with each line a file -q, --quiet do not print plain text distance matrix -t, --termlist-mode lines with each line a literal -s, --size just compressed sizes in bits no NCD -S, --server stdio server for easy language bindings -v, --verbose print extra detailed information -V, --version print complearn library version
de: Aufruf: ncd [Optionen] ... <arg> Benutzen Sie ein Argumentenformat für eine einfache Einzelobjekt- oder Objekt-Vektor-Kompression oder ncd [Optionen] ... <arg1> <arg2> für Kompressionsmatrix- oder NCD-Matrix-Berechnung. OPTIONEN: -b, --binary-output binären Ausgabemodus für Matrix einschalten -c, --compressor=COMPNAME zu benutzendes Packprogramm setzen -d, --directory-mode Verzeichnis der Dateien -f, --file-mode eine einzelne Datei -h, --help diese Hilfe ausgeben -l, --literal-mode eine einzelne wörtliche Zeichenkette (Vorgabe) -L, --list Packprogramme auflisten -n, --nexus-output eine Distanzmatrix im NEXUS-Format ausgeben -o, --output=DATEISTAMM DATEISTAMM anstelle der Distanzmatrix benutzen -p, --plainlist-mode Zeilen mit je einer Datei pro Zeile -q, --quiet keine Klartext-Distanzmatrix ausgeben -t, --termlist-mode Zeilen mit je einem Literal pro Zeile -s, --size nur gepackte Größe in Bits, kein NCD -S, --server STDIO-Server für einfache Sprachanbindungen -v, --verbose detaillierte Zusatzinformationen ausgeben -V, --version Complearn-Bibliotheksversion ausgeben

source: Available compressors:
de: Verfügbare Packprogramme:
ru: Доступные компрессоры:

source: Unhandled interpretation
de: Nicht behandelte Auslegung
ru: Параметр не обработан

source: Cannot load compressor %s
de: Packprogramm %s kann nicht geladen werden
ru: Не удалось загрузить компрессор %s

source: small
de: klein

source: Small memory footprint
de: Kleiner Speichergrundriss
ru: Маленькое потребление памяти

source: verbosity
de: Detailgrad

source: BZip2 Verbosity Level
de: BZip2-Detailstufe
ru: Уровень детализации BZip2

source: Window size in 100000-byte chunks
de: Fenstergröße in 100000-Byte-Stücken
ru: Размер окна в 100000-байтных блоках

source: Work factor for bzlib
de: Arbeitsfaktor für »bzlib«
ru: Показатель трудозатрат для bzlib

source: libbz2 (a.k.a. bzlib) blocksort style
de: »blocksort«-Stil von »libbz2« (alias »bzlib«)
ru: libbz2 (т.н. bzlib) blocksort-стиль

source: Compression level for ZLib, 1-9
de: Kompressionsstufe für ZLib, 1-9
ru: Уровень компрессии для ZLib, 1-9

source: Unknown error: zlibBuff returned %d
de: Unbekannter Fehler: »zlibBuff« gab %d zurück
ru: Неизвестная ошибка: zlibBuff вернула %d

source: Compressor %s returned NULL block for compression
de: Packprogramm %s gab NULL-Block für Kompression zurück
ru: Компрессор %s вернул NULL блок для сжатия

source: non-coding blocksort with fractional bit return
de: nicht codierter Blocksort mit gebrochener Bit-Rückgabe
ru: некодирующая сортировка блоков с дробным результатом

source: Cannot open directory %s
de: Verzeichnis %s kann nicht geöffnet werden
ru: Не удалось открыть каталог %s

source: Cannot open file %s
de: Datei %s kann nicht geöffnet werden
ru: Не удалось открыть файл %s

source: Cannot read line from file %s: %s
de: Zeile aus Datei %s kann nicht gelesen werden: %s
ru: Не удалось прочитать строку из файла %s: %s

source: Cannot change directory to %s
de: Wechsel in das Verzeichnis %s fehlgeschlagen
ru: Не удалось сменить каталог на %s

source: Cannot open directory %s. Error: %s
de: Verzeichnis %s kann nicht geöffnet werden. Fehler: %s
ru: Не удалось открыть каталог %s. Ошибка: %s

source: Cannot open file %s for writing.
de: Datei %s kann nicht zum Schreiben geöffnet werden
ru: Не удалось открыть файл %s на запись.

source: Cannot open file %s for reading
de: Datei %s kann nicht zum Lesen geöffnet werden
ru: Не удалось открыть файл %s на чтение
